CSI API ETABS v1

# cDCoItalianNTC2008CGetOverwrite Method

---

Retrieves the value of a concrete design overwrite item.

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetOverwrite(
    	string Name,
    	int Item,
    	ref double Value,
    	ref bool ProgDet
    )

    Function GetOverwrite (
    	Name As String,
    	Item As Integer,
    	ByRef Value As Double,
    	ByRef ProgDet As Boolean
    ) As Integer

    Dim instance As cDCoItalianNTC2008C
    Dim Name As String
    Dim Item As Integer
    Dim Value As Double
    Dim ProgDet As Boolean
    Dim returnValue As Integer

    returnValue = instance.GetOverwrite(Name,
    	Item, Value, ProgDet)

    int GetOverwrite(
    	String^ Name,
    	int Item,
    	double% Value,
    	bool% ProgDet
    )

    abstract GetOverwrite :
            Name : string *
            Item : int *
            Value : float byref *
            ProgDet : bool byref -> int

#### Parameters

Name

    Type: SystemString
The name of a frame object with a concrete frame design procedure.

Item

    Type: SystemInt32
This is an integer between 1 and 37, inclusive, indicating the overwrite item
considered.

  1. Framing type
  2. Live load reduction factor
  3. Unbraced length ratio, Major
  4. Unbraced length ratio, Minor
  5. Effective length factor, Beta Major (columns only)
  6. Effective length factor, Beat Minor (columns only)
  7. Moment coefficient, Cm Major (not used)
  8. Moment coefficient, Cm Minor (not used)
  9. Nonsway moment factor, Db Major (not used)
  10. Nonsway moment factor, Db Minor (not used)
  11. Sway moment factor, Ds Major (not used)
  12. Sway moment factor, Ds Minor (not used)
  13. Correction factor depending on axial load in Nominal Curvature method, Kr Major (columns only)
  14. Factor accounting for creep in Nominal Curvature method, KPhi Major (columns only)

  16. Correction factor depending on axial load in Nominal Curvature method, Kr Minor (columns only)
  17. Factor accounting for creep in Nominal Curvature method, KPhi Minor (columns only)
  18. Coefficient depending on the distribution of first-order moment in both Nominal Stiffness and Nominal Curvature methods, c Major (columns only)
  19. Coefficient depending on the distribution of first-order moment in both Nominal Stiffness and Nominal Curvature methods, c Minor (columns only)
  20. Factor for contribution of reinforcement, Ks Major (columns only)
  21. Factor for contribution of reinforcement, Ks Minor (columns only)
  22. Factor for effects of cracking, creep etc, Kc Major (columns only)
  23. Factor for effects of cracking, creep etc, Kc Minor (columns only)
  24. Effective creep coefficient, Phief (columns only)
  25. Ignore the benefit of Pu for beam design? (beams only)
  26. Consider torsion (beams only)
  27. Consider minimum eccentricity (columns only)
  28. Consider torsion (beams only)
  29. Consider minimum eccentricity (columns only)
  30. Coefficient of concrete compressive stress limit, k1
  31. Coefficient of steel tensile stress limit, k3
  32. Exposure class for crack control
  33. Limiting crack width
  34. Age at cracking of concrete, days
  35. Type of cement
  36. Load duration
  37. Longitudinal Rebar Size Top
  38. Longitudinal Rebar Size Bottom
  39. Is Longitudinal Rebar Ribbed

Value

    Type: SystemDouble
The value of the considered overwrite item.

  1. Framing type
     * 0 = Program Determined
     * 1 = DC High
     * 2 = DC Low
     * 3 = Secondary
  2. Live load reduction factor

Value >= 0; 0 means use program determined value

  3. Unbraced length ratio, Major

Value >= 0; 0 means use program determined value

  4. Unbraced length ratio, Minor

Value >= 0; 0 means use program determined value

  5. Effective length factor, Beta Major

Value >= 0; 0 means use program determined value

  6. Effective length factor, Beta Minor

Value >= 0; 0 means use program determined value

  7. Moment coefficient, Cm Major

Value >= 0; 0 means use program determined value

  8. Moment coefficient, Cm Minor

Value >= 0; 0 means use program determined value

  9. Nonsway moment factor, Db Major

Value >= 0; 0 means use program determined value

  10. Nonsway moment factor, Db Minor

Value >= 0; 0 means use program determined value

  11. Sway moment factor, Ds Major

Value >= 0; 0 means use program determined value

  12. Sway moment factor, Ds Minor

Value >= 0; 0 means use program determined value

  13. Correction factor depending on axial load in Nominal Curvature method, Kr Major

Value >= 0; 0 means use program determined value

  14. Factor accounting for creep in Nominal Curvature method, KPhi Major

Value >= 0; 0 means use program determined value

  15. Correction factor depending on axial load in Nominal Curvature method, Kr Minor

Value >= 0; 0 means use program determined value

  16. Factor accounting for creep in Nominal Curvature method, KPhi Minor

Value >= 0; 0 means use program determined value

  17. Coefficient depending on the distribution of first-order moment in both Nominal Stiffness and Nominal Curvature methods, c Major

Value >= 0; 0 means use program determined value

  18. Coefficient depending on the distribution of first-order moment in both Nominal Stiffness and Nominal Curvature methods, c Minor

Value >= 0; 0 means use program determined value

  19. Factor for contribution of reinforcement, Ks Major

Value >= 0; 0 means use program determined value

  20. Factor for contribution of reinforcement, Ks Minor

Value >= 0; 0 means use program determined value

  21. Factor for effects of cracking, creep etc, Kc Major

Value >= 0; 0 means use program determined value

  22. Factor for effects of cracking, creep etc, Kc Minor

Value >= 0; 0 means use program determined value

  23. Effective creep coefficient, Phief

Value >= 0; 0 means use program determined value

  24. Ignore the benefit of Pu for beam design?
     * 0 = No
     * Any other value = Yes
  25. Consider torsion
     * 0 = No
     * Any other value = Yes
  26. Consider minimum eccentricity
     * 0 = No
     * Any other value = Yes
  27. Coefficient of concrete compressive stress limit, k1

Value >= 0; 0 means use program determined value

  28. Coefficient of steel tensile stress limit, k3

Value >= 0; 0 means use program determined value

  29. Exposure class for crack control
     * 0 = Program Determined
     * 1 = X0
     * 2 = XC1
     * 3 = XC2
     * 4 = XC3
     * 5 = XC4
     * 6 = XD1
     * 7 = XD2
     * 8 = XS1
     * 9 = XS2
     * 10 = XS3
  30. Limiting crack width

Value >= 0; 0 means use program determined value

  31. Age at cracking of concrete, days

Value >= 0; 0 means use program determined value

  32. Exposure class for crack control
     * 0 = Program Determined
     * 1 = Class R
     * 2 = Class N
     * 3 = Class S
  33. Loading duration
     * 0 = Program Determined
     * 1 = Short term
     * 2 = Long term
  34. Longitudinal Rebar Size Top

Value is the index in the list of the rebar defined in the Reinforcing Bar
Sizes form

  35. Longitudinal Rebar Size Bottom

Value is the index in the list of the rebar defined in the Reinforcing Bar
Sizes form

  36. Is Longitudinal Rebar Ribbed
     * 0 = No
     * Any other value = Yes

ProgDet

    Type: SystemBoolean
If this item is True, the specified value is program determined.

#### Return Value

Type: Int32
Returns zero if the item is successfully retrieved; otherwise it returns a
nonzero value.

Remarks

Examples

VB

Copy

    Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Value As Double
       Dim ProgDet As Boolean

    'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")

    'start ETABS application
      ret = EtabsObject.ApplicationStart()

    'create SapModel object
       SapModel = EtabsObject.SapModel

    'initialize model
       ret = SapModel.InitializeNewModel()

    'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)

    'create new concrete frame section property
       ret = SapModel.PropFrame.SetRectangle("R1", "4000Psi", 20, 12)

    'set frame section property
       ret = SapModel.FrameObj.SetSection("8", "R1")

    'set concrete design code
       ret = SapModel.DesignConcrete.SetCode("Italian NTC 2008")

    'run analysis
       System.IO.Directory.CreateDirectory("c:\CSI_API_temp")
       ret = SapModel.File.Save("C:\CSI_API_temp\example.edb")
       ret = SapModel.Analyze.RunAnalysis

    'start concrete design
       ret = SapModel.DesignConcrete.StartDesign()

    'get overwrite item
       ret = SapModel.DesignConcrete.ItalianNTC2008C.GetOverwrite("8", 1, Value, ProgDet)

    'close ETABS
       EtabsObject.ApplicationExit(False)

    'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing

    End Sub

See Also

#### Reference

cDCoItalianNTC2008C Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com